000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HelloWorld.
000300 DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 HELLO-WORLD PIC X(32) VALUE IS 'Hello, World'.
       
       PROCEDURE DIVISION.
           DISPLAY HELLO-WORLD.
       
       STOP RUN.